Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/bulk_face.po
Languages: ru

source: Bulk Face Enrollment
ru: Пакетная загрузка лиц

source: The Bulk Face Enrollment feature allows for enrolling faces to findface-facenapi from images in bulk.
ru: Функция пакетного добавления лиц позволяет отправлять лица в компонент ``findface-facenapi`` одновременно из множества изображений.

source: General Information
ru: Общие сведения

source: You can bulk-enroll faces in one of the following ways:
ru: Вы можете пакетно добавлять лица одним из следующих способов:

source: from images in a current directory,
ru: из изображений в текущей папке,

source: from images in a given subdirectory,
ru: из изображений в заданной дочерней папке,

source: from images from all subdirectories.
ru: из изображений во всех дочерних папках.

source: To install the Bulk Face Enrollment component, execute:
ru: Для того чтобы установить компонент для пакетного добавления лиц, выполните команду:

source: To display the component help message, execute:
ru: Для того чтобы отобразить справку по компоненту, выполните команду:

source: To harness the feature, do the following:
ru: Для пакетного добавления лиц выполните следующие действия:

source: Prepare a job file containing the list of images with metadata (``prepare``). If all images share the same metastring, you can specify it right in the command line when preparing the job file (``--meta-const``). If each image has a unique metastring, map metastrings to images in a CSV file (``--meta-csv``).
ru: Подготовьте файл задания (job-файл), содержащий список изображений с метаданными (метод ``prepare``). Если все изображения имеют одинаковую строку с метаданными, вы можете указать ее прямо в командной строке при подготовке job-файла (опция ``--meta-const``). Если каждому изображению должна соответствовать уникальная строка с метаданными, задайте соответствие метаданных изображениям в CSV-файле (опция ``--meta-csv``).

source: To write the list of images to a CSV file, you can use the command below. Each image in the list will be associated with a metastring coinciding with the image full path (in the format ``metastring | image``).
ru: Для того чтобы записать список изображений в CSV-файл, можно использовать приведенную ниже команду. В этом случае для каждого изображения в списке в качестве строки с метаданными будет создана строка с указанием полного пути к изображению (в формате ``метаданные | изображение``).

source: If necessary, display the job file content (``print``).
ru: При необходимости отобразите содержимое job-файла (метод ``print``).

source: Enroll faces to findface-facenapi for further processing (``run``).
ru: Отправьте лица в компонент findface-facenapi для дальнейшей обработки (метод ``run``).

source: Should an error occur during the job file processing, correct the mistake and try again with the option --failed (see examples below).
ru: В случае неудачи при обработке job-файла исправьте ошибку и повторите попытку с опцией ``--failed`` (см. пример ниже).

source: Example
ru: Пример

source: To display the list of images in a directory, execute:
ru: Для отображения списка всех файлов в папке выполните команду:

source: Prepare a job file:
ru: Подготовьте job-файл:

source: Run the job file:
ru: Выполните job-file:
