Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/findface_ui.po
Languages: ru

source: FindFace Web User Interface
ru: Веб-интерфейс FindFace

source: FindFace Enterprise Server SDK is equipped with a web user interface which generally duplicates the functionality available via REST API.
ru: Веб-интерфейс FindFace Enterprise Server SDK дублирует большинство функций, доступных через REST API.

source: To install the web interface, execute on the ``findface-facenapi`` host:
ru: Для того чтобы установить веб-интерфейс, выполните на сервере ``findface-facenapi`` следующие команды:

source: To open the web interface, do the following:
ru: Для того чтобы отобразить веб-интерфейс, выполните следующие действия:

source: In the address bar of your browser, enter ``http://<facenapi_ip>:8000/#/``.
ru: В адресной строке браузера введите ``http://<facenapi_ip>:8000/#/``.

source: To log in, specify the :ref:`authentication token <token>` for your FindFace Enterprise Server SDK instance. The web interface home page will appear.
ru: Для того чтобы войти в веб-интерфейс, укажите :ref:`токен авторизации <token>` своего экземпляра FindFace Enterprise Server SDK. В результате отобразится домашняя страница веб-интерфейса.

source: The web interface has a highly intuitive and handy design and provides the following functionality:
ru: Веб-интерфейс имеет интуитивный и удобный дизайн и обеспечивает доступ к следующим функциями:

source: To work with gender, age and emotions recognition (GAE) in the web interface, you need to :ref:`configure <gae>` it in the settings.
ru: Для работы с распознаванием пола, возраста и эмоций (GAE) в веб-интерфейсе данную функцию нужно :ref:`настроить <gae>`.

source: Working with photos requires configured :ref:`findface-upload <findface-upload>`.
ru: Для работы с фотографиями необходим настроенный компонент :ref:`findface-upload <findface-upload>`.

source: Working with persons requires configured :ref:`dynamic person creation <persons>`.
ru: Для работы с персонами необходимо настроить :ref:`группировку лиц одного человека <persons>`.

source: To allow the web interface to run Flash in :program:`Chrome`, add its IP address to the relevant list: :menuselection:`Settings --> Advanced --> Content settings --> Flash --> Allow --> Add a site` ``http://<facenapi_ip>:8000/#/``. Restart :program:`Chrome`.
ru: Для того чтобы разрешить веб-интерфейсу проигрывать Flash в браузере Chrome, добавьте IP-адрес веб-интерфейса в список разрешенных веб-сайтов: :menuselection:`Настройки --> Дополнительно --> Настройки контента --> Flash --> Разрешить --> Добавить сайт` ``http://<facenapi_ip>:8000/#/`. Перезапустите :program:`Chrome`.

source: :guilabel:`Galleries`. Create and delete galleries here.
ru: :guilabel:`Galleries` (Галереи). В данном разделе можно добавлять и удалять галереи.

source: :guilabel:`Faces`. In this section, you can view, add and delete faces from the galleries.
ru: :guilabel:`Faces`(Лица). В данном разделе можжно просматривать, добавлять и удалять лица из галерей.

source: Use the :guilabel:`Batch upload` option to upload image files in bulk.
ru: Используйте опцию :guilabel:`Batch upload`, чтобы добавить лица пакетно.

source: You may also want to use its :ref:`console alternative <bulk-face>`.
ru: Возможно, вы также захотите воспользоваться ее :ref:`консольной альтернативой <bulk-face>`.

source: Select multiple files or a directory, and then configure the automatic meta description for the enrolled faces. Use :guilabel:`&MF selector` to specify behavior in case if multiple faces are detected in an image: enroll all faces, only the biggest one, or reject enrollment.
ru: Выберите несколько изображений по отдельности или укажите папку и затем настройте правило формирования строки с метаданными для загружаемых лиц. Используйте :guilabel:`&MF selector`, чтобы задать поведение системы.
