Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/friend.po
Languages: ru

source: 'Friend or Foe' Identification
ru: Распознавание «свой-чужой»

source: As you configure :ref:`persons`, you can also enable 'friend or foe' identification in order to further enhance your video analytics.
ru: Для расширения функционала видеоаналитики после настройки :ref:`группировки лиц одного человека <persons>` можно активировать распознавание «свой-чужой».

source: About Friends and Foes
ru: О своих и чужих

source: The 'friend or foe' identification system of FindFace Enterprise Server SDK can positively identify only friends, not foes. A friend is a person whose face has been captured a certain number of days by the same camera during a certain period of time. In all other cases, a person is just considered to be 'not a friend'.
ru: Система распознавания «свой-чужой» Сервера FindFace может положительно определять только «своих», не «чужих». «Свой» — это человек, чье лицо попадало в поле зрения одной и той же видеокамеры определенное количество дней в течение определенного промежутка времени. Во всех других случаях человек рассматривается лишь как «не свой».

source: Enable 'Friend or Foe' Identification
ru: Включение распознавания «свой-чужой»

source: To enable 'friend or foe' identification, do the following:
ru: Для включения распознавания «Cвой-чужой» выполните следующие действия:

source: Configure and tryout :ref:`dynamic person creation <persons>`.
ru: Настройте и выполните отладку функции :ref:`группировки лиц одного человека <persons>`.

source: Open the ``findface-facenapi.ini`` configuration file for editing.
ru: Откройте для редактирования файл конфигурации ``findface-facenapi.ini``.

source: Edit the settings.
ru: Отредактируйте настройки.

source: The ``findface-facenapi.ini`` content must be correct Python code.
ru: Содержимое файла ``findface-facenapi.ini`` должно представлять собой синтаксически верный код Python.

source: Restart the service.
ru: Перезапустите сервис ``findface-facenapi``.

source: 'Friend or Foe' Identification in REST API
ru: Распознавание «свой-чужой» в REST API

source: The example below demonstrates a ``POST /face`` request and the corresponding response containing the 'friend' parameter (``"friend": true`` or ``"friend": false``).
ru: Ниже приведен пример запроса ``POST /face`` и соответствующего ответа, содержащего параметр ``friend`` («свой») (``"friend": true`` или ``"friend": false``).

source: Request
ru: Запрос

source: Response
ru: Ответ
