Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/gae.po
Languages: ru

source: Gender, Age and Emotions Recognition
ru: Распознавание пола, возраста и эмоций

source: Configure Gender, Age and Emotions Recognition
ru: Настройка распознавания пола, возраста и эмоций

source: Gender, age and emotions recognition uses around 2 GB of RAM in addition to the FindFace Server :ref:`general requirements <requirements>`.
ru: Для распознавания пола, возраста и эмоций необходимы 2 Гбайт оперативной памяти сверх :ref:`общих требований <requirements>` к Серверу FindFace.

source: To configure gender, age and emotions recognition, do the following:
ru: Для настройки распознавания пола, возраста и эмоций выполните следующие действия:

source: The ``findface-facenapi.ini`` content must be correct Python code.
ru: Содержимое файла ``findface-facenapi.ini`` должно представлять собой синтаксически верный код Python.

source: API Requests for Gender, Age and Emotions Recognition
ru: API для распознавания пола, возраста и эмоций

source: An exemplary API request for recognizing gender, age and emotions of a person, and the corresponding response are shown below.
ru: Данный запрос обнаруживает лицо на тестовом изображении, размещенном в сети Интернет, и возвращает координаты рамки вокруг лица вместе с информацией о поле, возрасте и эмоциях. Соответствующий метод REST API: :ref:`/detect POST <detect-post>`. Версия API: v1.

source: Request #1
ru: Запрос №1

source: Response
ru: Ответ

source: To add a face to the database with its gender, age and emotions information, send a POST request to **v1/face**.
ru: Для добавления лица в базу данных вместе с информацией о поле, возрасте и эмоциях, отправьте POST-запрос на адрес ``v1/face``.

source: Request #2
ru: Запрос №2
