Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/get_started.po
Languages: ru

source: Get Started
ru: Приступая к интеграции

source: Here you can see a typical biometric system based on FindFace Enterprise Server SDK:
ru: Структура системы анализа и распознавания лиц на базе FindFace Enterprise Server SDK показана на следующей схеме:

source: FindFace Enterprise Server SDK consists of the :program:`Biometric Data Analysis and Recognition Server` (:program:`FindFace Server` or :program:`Server` hereinafter) and, optionally, the video face detector and other :ref:`additional components <extra-functionality>`.
ru: FindFace Enterprise Server SDK включает в себя :program:`Сервер анализа и распознавания биометрических данных` (далее :program:`Сервер FindFace` или :program:`Сервер`) и, опционально, видеодетектор для обнаружения лиц в видеопотоке (устанавливается как компонент ``fkvideo_detector``) и другие :ref:`дополнительные компоненты <extra-functionality>`.

source: The FindFace Server functioning is provided by interaction of the following components:
ru: Работу Сервера в свою очередь обеспечивают следующие компоненты:

source: Component
ru: Компонент

source: Description
ru: Описание

source: Python daemon which runs HTTP API. This daemon executes face detection functions, interfaces with ``MongoDB`` and ``findface-nnapi`` and ``tarantool@FindFace`` daemons.
ru: Реализованный на Python сервис, обеспечивающий функционирование HTTP API. Данный сервис выполняет функцию обнаружения лиц на фотографиях, взаимодействует с базой данных ``MongoDB`` и сервисами ``findface-nnapi`` и ``tarantool@FindFace``.

source: ``tntapi`` (``tarantool@FindFace`` as a shard)
ru: ``tntapi`` (``tarantool@FindFace`` как шард)

source: Daemon which enables interaction with the face descriptors index.
ru: Сервис, обеспечивающий взаимодействие между сервисом ``findface-facenapi`` и базой биометрических данных на основе ``Tarantool``. Для увеличения скорости поиска на каждом сервере с базой данных ``Tarantool`` могут быть созданы многочисленные сегменты («шарды») tntapi. Их параллельное функционирование приводит к значительному увеличению производительности (в 70-100 раз).

source: Daemon extracts a feature vector (based on neural network). Requires the packages with :ref:`models <models>` :program:`<findface-data>.deb`.
ru: Сервис, выполняющий посредством нейронных сетей извлечение вектора признаков (биометрического бразца) из обнаруженных лиц. Требует установки пакетов с :ref:`моделями нейронных сетей <models>` :program:`<findface-data>.deb`.

source: Database which stores faces metadata, galleries details, settings, etc.
ru: База данных, в которой хранятся метаданные лиц, подробная информация о галереях, настройки и т. д.

source: Nginx web server used to receive images using WebDAV.
ru: Веб-сервер на базе nginx, который принимает изображения через WebDAV. Устанавливается, если требуется хранить исходные загруженные изображения, миниатюры и нормализованные изображения лиц на Сервере.

source: Local license server which interfaces with NtechLab Global License Server (for network licensing) or a USB dongle (for on-premise licensing) and passes a license to licensable components.
ru: Локальный сервер лицензий NTLS, который для проверки лицензии взаимодействует с глобальным сервером лицензий компании «НТех лаб» (в случае сетевой лицензии) или с ключом аппаратной защиты Guardant (при лицензировании в закрытой сети) и в случае успеха отправляет разрешения лицензируемым компонентам.

source: Follow the **9 steps** below to start delivering face recognition services to your customers:
ru: Интеграция FindFace Enterprise Server SDK включает в себя следующие основные этапы:

source: :ref:`Choose deployment architecture <architecture>`
ru: :ref:`выбор архитектуры развертывания <architecture>`;

source: :ref:`Prepare hardware <requirements>`
ru: :ref:`подготовка физических серверов <requirements>`;

source: :ref:`Install prerequisites <prerequisites>`
ru: :ref:`установка необходимого стороннего ПО <prerequisites>`;

source: :ref:`Install FindFace Server <install-server>`
ru: :ref:`установка лицензии и компонентов Сервера <install-server>`;

source: :ref:`Create a token <token>` and :ref:`test the system work <test>`
ru: :ref:`создание токена авторизации <token>` and :ref:`тестирование работы сервера <test>`;

source: :ref:`Configure video face detection <video>`
ru: :ref:`настройка обнаружения лиц на видео <video>`;

source: Increase performance by setting up :ref:`nginx load balancing <load-balancing>` and :ref:`fast index <fast-index>`
ru: Увеличение производительности путем :ref:`балансировки нагрузки на компоненты <load-balancing>` и :ref:`индексированием базы данных <fast-index>`;

source: :ref:`Add advanced features <advanced>`
ru: :ref:`настройка расширенных функций <advanced>`;

source: :ref:`Finalize the system with coding <api>`
ru: :ref:`создание интерфейса обмена данными между Сервером и партнерским приложением <api>`;
