Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: ru

source: Welcome to FindFace Enterprise Server SDK's documentation!
ru: Руководство по интеграции FindFace Enterprise Server SDK

source: FindFace Enterprise Server SDK provides professional face recognition services based on neural networks. Implement these services to your ecosystem to take full advantage of them.
ru: FindFace Enterprise Server SDK – это промышленная высокопроизводительная программно-технологическая платформа нового поколения, которая позволяет создавать интегрированные биометрические системы фото- и видеоидентификации любого масштаба – от небольших решений уровня предприятия до городских, федеральных и международных проектов.

source: Features:
ru: Возможности:

source: Fast and robust face detection and database enrollment. Possibility of enrolling faces in bulk.
ru: Быстрое и надежное обнаружение лиц на фото и видео, их биометрическая обработка и запись в базу данных. Возможность пакетной загрузки лиц.

source: Intelligent video face detection and analytics.
ru: Интеллектуальная видеоаналитика.

source: Fast and accurate face identification and verification based on neural networks.
ru: Быстрая и точная идентификация и верификация лиц алгоритмами на основе нейронных сетей.

source: Gender, age and emotions recognition.
ru: Распознавание пола, возраста и эмоций.

source: Dynamic person creation and 'friend or foe' identification.
ru: Группировка лиц одной персоны в базе данных и распознавание «свой-чужой».

source: Almost infinite scalability due to integration with Tarantool.
ru: Неограниченная масштабируемость благодаря интеграции с Tarantool.

source: Truly RESTful API available in an embedded user friendly framework.
ru: Удобный многофункциональный интерфейс REST API со встроенным фреймворком для тестирования.

source: Possibility of formatting API-responses.
ru: Возможность гибкой настройки формата API-ответа.

source: Highly intuitive web user interface.
ru: Дружественный веб-интерфейс.

source: Network or on-premise licensing.
ru: Возможность лицензирования в открытых и закрытых системах.

source: To read a release changelog, execute:
ru: Для ознакомления со списком изменений в версии, выполните команду:

source: FindFace Enterprise Server SDK will be of interest to independent software vendors (ISVs), system integrators, enterprise IT customers, and original equipment manufacturers (OEMs). It can be harnessed in numerous areas, such as retail, banking, social networking, entertainment, sports, event management, dating services, video surveillance, public safety, homeland security, etc.
ru: FindFace Enterprise Server SDK предназначен для независимых производителей программного обеспечения, системных интеграторов, корпоративных заказчиков, а также производителей оборудования, программно-аппаратных решений и облачных сервисов. FindFace Enterprise Server SDK будет востребован в таких областях, как розничная торговля, банковское обслуживание, индустрия развлечений, спортивные мероприятия, организация мероприятий, сервисы знакомств, видеонаблюдение, государственное управление, общественная и корпоративная безопасность, транспорт, медицина и многие другие.

source: Being integrated into specific solutions or Android applications, FindFace Enterprise Server SDK empowers businesses to accomplish such goals as biometric identification and access control, customer analytics, customer offer tailoring, offline retargeting, managing white and black lists, sorting and optimizing media libraries, borrower scoring, fraud prevention, employee productivity control, and many more.
ru: FindFace Enterprise Server SDK может использоваться как платформа для построения интегрированных отраслевых решений, которые позволят заказчикам решать задачи в таких областях, как биометрическая идентификация и аутентификация, контроль и управление доступом, работа со списками «свой-чужой», работа с большими объемами медиа-данных, оценка контрагентов, аттестация сотрудников, предотвращение правонарушений, контроль аффилированности, расследование инцидентов, мониторинг активности в социальных сетях.

source: This guide is intended for developers and system integration engineers who are going to integrate face recognition services into their systems. Prior to deploying a development environment, explore the :ref:`9 steps to face recognition <start>`. This will give you a general idea of the deployment process.
ru: Руководство предназначается для специалистов по интеграции, системных администраторов, специалистов по установке и настройке систем анализа и распознавания биометрических данных на базе FindFace Enterprise Server SDK, а также для разработчиков приложений на его основе. Для начала мы рекомендуем вам ознакомиться с :ref:`основными этапами <start>` интеграции. Это даст вам общее представление о процессе развертывания FindFace Enterprise Server SDK.

source: Let's get started!
ru: Давайте приступим!

source: Contents:
ru: Содержание:
