Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/install.po
Languages: ru

source: Install FindFace Server
ru: Установка компонентов Сервера

source: This section will guide you through the FindFace Server step-by-step installation process. Follow the instructions below minding the sequence.
ru: Данный раздел содержит сведения о пошаговой настройке лицензирования и установке компонентов Сервера FindFace. Выполните приведенные ниже инструкции, придерживаясь заданного порядка.

source: Standalone installation can also be done from a developer-friendly :ref:`installer <installer>`.
ru: Установка на одном физическом сервере также может быть выполнена с помощью :ref:`консольного инсталлятора <installer>`.

source: In this section:
ru: В этом разделе:

source: Prepare Packages for Installation
ru: Подготовка deb-пакетов к установке

source: FindFace Enterprise Server SDK can be installed from a local repository. You can receive the FindFace Enterprise Server SDK distributable packages from your NTechLab manager. To prepare the packages for installation, do the following:
ru: Для получения установочных пакетов FindFace Enterprise Server SDK свяжитесь со своим менеджером компании «НТех лаб». Для того чтобы подготовить пакеты к установке, выполните следующие действия:

source: The ``ntech`` user will be automatically created at this stage. To avoid a conflict, make sure that such a user does not already exist in the system.
ru: На данном этапе будет автоматически создан пользователь ``ntech``. Во избежание конфликта убедитесь, что пользователь с таким именем отсутствует в системе.

source: Unpack the package with components on each designated host.
ru: Распакуйте пакет с компонентами на каждом из физических серверов развертывания.

source: Unpack the packages with :ref:`models <models>` (face, gender, age, and emotions). In the cluster environment, models are installed only on the ``findface-nnapi`` hosts.
ru: Распакуйте пакеты с :ref:`моделями нейронных сетей <models>` (биометрия лица, пол, возраст, эмоции). Если FindFace Enterprise Server SDK развертывается на кластере серверов, модели устанавливаются только на серверах ``findface-nnapi``.

source: Add a signature key on each designated host.
ru: Добавьте ключ подписи на каждом из серверов развертывания.

source: Licensing
ru: Лицензирование

source: You receive a license file from your NTechLab manager along with the FindFace Enterprise Server SDK distributable packages. If you opt for on-premise licensing, we will also send you a Guardant USB dongle. The licensing scheme for FindFace Enterprise Server SDK is shown on the diagram below.
ru: Вы получаете файл лицензии вместе с установочными пакетами FindFace Enterprise Server SDK от менеджера «Нтех лаб». Если вы выберите лицензирование в закрытой сети, вам также будет отправлен ключ аппаратной защиты Guardant. Принцип лицензирования FindFace Enterprise Server SDK показан на схеме ниже:

source: To provide the FindFace Enterprise Server SDK licensing, follow the steps below:
ru: Этапы лицензирования:

source: Install and configure the local license server :program:`NTLS`.
ru: Установите и настройте локальный сервер лицензий :program:`NTLS`.

source: If the licensable components (``findface-nnapi``, ``tntapi``, ``fkvideo_detector``, ``extraction-api``) are installed on remote hosts, specify the NTLS host IP address in their configuration files.
ru: Если лицензируемые компоненты (``findface-nnapi``, ``tntapi``, ``fkvideo_detector`` и ``extraction-api``) установлены на удаленных серверах, укажите IP-адрес сервера NTLS в их файлах конфигурации.

source: To install and configure NTLS, do the following:
ru: Для того чтобы установить и настроить NTLS, выполните следующие действия:

source: Install the NTLS component::
ru: Установите компонент NTLS::

source: In the NTLS configuration file, you can change the license folder and specify your proxy server IP address if necessary. You can also change the NTLS web interface remote access settings. To open the NTLS configuration file, execute::
ru: В файле конфигурации NTLS вы можете изменить папку для хранения файла лицензии и при необходимости указать IP-адрес прокси-сервера для доступа в Интернет. Вы также можете настроить удаленный доступ к веб-интерфейсу NTLS, используемому для управления лицензией. Для того чтобы открыть файл конфигурации NTLS, выполните команду::

source: If necessary, uncomment the ``proxy`` line and specify your proxy server IP address::
ru: При необходимости раскомментируйте строку ``proxy`` и укажите IP-адрес прокси-сервера::

source: By default, you can access the NTLS web interface from any remote host (``ui = 0.0.0.0:3185``). To indicate that accessing the NTLS web interface must originate from a specific IP address, edit the ``ui`` parameter::
ru: По умолчанию доступ в веб-интерфейс NTLS возможен с любого удаленного сервера (``ui = 0.0.0.0:3185``). Для того чтобы обеспечить доступ к веб-интерфейсу NTLS только с определенного IP-адреса, отредактируйте параметр ``ui``::

source: Upload the license file via the NTLS web interface ``http://<NTLS_IP_address>:3185/#/``. You can also use the NTLS web interface to consult your license information, and upgrade or extend the license.
ru: Загрузите файл лицензии в веб-интерфейсе NTLS по адресу ``http://<IP-адрес NTLS>:3185/#/``. Вы также можете использовать веб-интерфейс NTLS для продления и апгрейда лицензии.

source: For on-premise licensing, insert the Guardant dongle into a USB port.
ru: Для лицензирования в закрытой сети также нужно вставить ключ Guardant в USB-порт.

source: If the licensable components (``findface-nnapi``, ``tntapi``, ``fkvideo_detector``, ``extraction-api``) are to be installed on remote hosts, keep in mind that you have to specify the IP address of the NTLS host in their configuration files after installation.
ru: Если лицензируемые компоненты (``findface-nnapi``, ``tntapi``, ``fkvideo_detector`` и ``extraction-api``) будут установлены на удаленных серверах, обязательно укажите IP-адрес сервера NTLS в их файлах конфигурации после установки.

source: Install Components
ru: Установка компонентов Сервера

source: Now that you have prepared the FindFace Enterprise Server SDK packages and provided the licensing, install the Server components on designated host(s) according to your architecture outline.
ru: После того как deb-пакеты FindFace Enterprise Server SDK подготовлены, а лицензирование настроено, установите компоненты Сервера в соответствии с архитектурной схемой.

source: Install facenapi
ru: Установка facenapi

source: Install and configure the ``findface-facenapi`` component as follows:
ru: Установите и настройте компонент ``findface-facenapi`` следующим образом:

source: Install the component.
ru: Установите компонент.

source: Check if the component is runnable. To do so, invoke the ``findface-facenapi`` application by executing the command below. As the application is invoked, hold 1 minute, and if no errors display, hit :kbd:`Ctrl+C`.
ru: Проверьте работоспособность компонента. Для этого вызовите приложение ``findface-facenapi``, выполнив приведенную ниже команду. После вызова подождите минуту. Если ошибок не обнаружено, верните контроль над командной строкой, нажав сочетание клавиш :kbd:`Ctrl+C`.

source: Enable the service autostart and launch the service.
ru: Добавьте сервис в автозагрузку и запустите его.

source: Install nnapi
ru: Установка findface-nnapi

source: Install and configure the ``findface-nnapi`` component as follows:
ru: Установите и настройте компонент ``findface-nnapi`` следующим образом:

source: You may also want to learn about :ref:`gender, age and emotions recognition <gae>`.
ru: Возможно, вам также захочется прочитать о :ref:`распознавании пола, возраста и эмоций <gae>`.

source: Check if the component is runnable. To do so, invoke the ``findface-nnapi`` application by executing the command below. As the application is invoked, hold 1 minute, and if no errors display, hit :kbd:`Ctrl+C`.
ru: Проверьте работоспособность компонента. Для этого вызовите приложение ``findface-nnapi``, выполнив приведенную ниже команду. После вызова подождите минуту. Если ошибок не обнаружено, верните контроль над командной строкой, нажав сочетание клавиш :kbd:`Ctrl+C`.

source: Install findface-upload
ru: Установка findface-upload

source: To store all original images which have been processed by Server, as well as such Server artifacts as face thumbnails and normalized images, install and configure the ``findface-upload`` component.
ru: Для хранения на Сервере FindFace всех обработанных исходных изображений, а также таких артефактов Сервера, как миниатюры и нормализованные изображения лиц, установите и настройте компонент ``findface-upload``.

source: Skip this procedure if you do not want to store these data on the FindFace Enterprise Server SDK host. In this case, only face features vectors (facens) will be stored (in MongoDB and Tarantool databases).
ru: Пропустите данный шаг, если вы не собираетесь хранить эти данные. В этом случае на Сервере будут храниться только биометрические образцы (в базах данных ``MongoDB`` и ``Tarantool``).

source: Do the following:
ru: Выполните следующие действия:

source: Install the component::
ru: Установите компонент::

source: Install tntapi
ru: Установка tntapi

source: The tntapi component connects the Tarantool database and the facenapi component, transferring search results from the database to facenapi for further processing. To increase search speed, multiple tntapi shards can be created on each Tarantool host. Their running concurrently leads to a remarkable increase in performance. Each shard can handle up to approximately 10,000,000 faces. In the case of standalone deployment, you need only one shard (created by default), while in a cluster environment the number of shards has to be calculated depending on several parameters (see below).
ru: Компонент ``tntapi`` соединяет базу данных Tarantool и компонент ``findface-facenapi``, передавая результаты поиска от базы данных в ``findface-facenapi`` для дальнейшей обработки. Для увеличения скорости поиска на каждом сервере с базой данных ``Tarantool`` могут быть созданы многочисленные сегменты (шарды) ``tntapi``. Их параллельное функционирование приводит к значительному увеличению производительности. Каждый шард может обрабатывать приблизительно до ``10 000 000`` лиц. Если FindFace Enterprise Server SDK развертывается на одном сервере, одного шарда, созданного по умолчанию, будет достаточно. При развертывании в кластерной среде количество шардов рассчитывается в зависимости от нескольких параметров (см. ниже).

source: Install tntapi standalone
ru: Установка tntapi на одном сервере

source: Install and configure the ``tntapi`` component as follows:
ru: Установите и настройте компонент ``findface-nnapi`` следующим образом:

source: Install tntapi cluster
ru: Установка tntapi на кластере серверов

source: When creating shards in large installations, observe the following rules:
ru: При создании шардов для крупных проектов соблюдайте следующие правила:

source: The number of shards on a single host should not exceed the number of its physical processor cores minus 1.
ru: Количество шардов на одном сервере не должно превышать число физических ядер процессора минус 1.

source: Write a bash script ``shard.sh`` that will automatically create configuration files for all shards on a particular host. Do so for the 4 hosts. Use the following script as a base for your own code. The exemplary script creates 4 shards listening to the ports: tntapi ``33001..33004`` and http ``8001..8004``.
ru: Напишите bash-скрипт ``shard.sh``, который автоматически создаст шарды и файлы конфигурации для каждого из них. Скрипт должен быть написан для каждого из 4-х серверов. Используйте приведенный ниже скрипт как основу для своего кода. Данный скрипт создает на сервере 4 шарда, использующие порты: tntapi ``33001..33004`` и http ``8001..8004``.

source: Download the :download:`exemplary script <_scripts/shard.sh>`.
ru: Загрузите :download:`пример скрипта <_scripts/shard.sh>`.

source: Check the configuration files created.
ru: Проверьте, созданы ли файлы конфигурации.

source: Retrieve the shards status.
ru: Проверьте статус шардов.

source: On the ``findface-facenapi`` host, create a file ``tntapi_cluster.json`` containing the addresses and ports of all the shards. Distribute available shards evenly over ~1024 cells in one line. Click `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/tntapi_cluster.json>`__ to see the file for 4 hosts with 4 shards on each.
ru: На сервере с компонентом ``findface-facenapi`` создайте файл ``tntapi_cluster.json``, содержащий адреса и порты всех шардов. Распределите доступные шарды равномерно по 1024 ячейкам в одной строке. Нажмите `здесь <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/tntapi_cluster.json>`__, чтобы посмотреть, как выглядит файл для 4 серверов с 4 шардами на каждом.

source: You can create ``tntapi_cluster.json`` as follows:
ru: Вы можете создать файл ``tntapi_cluster.json`` следующим образом:

source: Create a file that lists all the shards, each shard with a new line (click `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/s.txt>`__ to view the example).
ru: Создайте файл с линейным списком всех шардов, каждый шард с новой строки (нажмите `здесь <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/s.txt>`__, чтобы посмотреть пример).

source: Run the script below (click `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/creating_tntapi_cluster.json_script.md>`__ to view the script). As a result, a new file ``tntapi_cluster.json`` will be created and contain a list of all shards distributed evenly over 1024 cells.
ru: Выполните приведенный ниже `скрипт <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/creating_tntapi_cluster.json_script.md>`__. В результате будет создан новый файл ``tntapi_cluster.json``, содержащий список адресов и портов всех шардов, равномерно распределенных по 1024 ячейкам.

source: Configure Network
ru: Сетевые настройки

source: After you install the FindFace Server components, configure their interaction with each other. Do the following:
ru: После установки компонентов Сервера FindFace настройте их взаимодействие друг с другом. Выполните следующие действия:

source: Open the ``findface-facenapi.ini`` configuration file::
ru: Откройте для редактирования файл конфигурации ``findface-facenapi.ini``.

source: Uncomment and/or edit the settings to align with your network specifications, substituting the suggested values with actual location::
ru: Отредактируйте настройки в соответствии с фактическим распределением компонентов.

source: The ``findface-facenapi.ini`` content must be correct Python code.
ru: Содержимое файла ``findface-facenapi.ini`` должно представлять собой синтаксически верный код Python.

source: By default, if one or several tntapi shards are out of service during face identification, :program:`findface-facenapi` returns an error. If necessary, uncomment the ``tntapi_ignore_search_error`` parameter and assign it ``True``. In this case findface-facenapi will use available tntapi shards to obtain face identification results, indicating the number of available servers vs the total number of servers in the response::
ru: По умолчанию, если один или несколько шардов ``tntapi`` будут недоступны во время идентификации лица, компонент ``findface-facenapi`` вернет ошибку. При необходимости раскомментируйте параметр ``tntapi_ignore_search_error`` и присвойте ему значение ``True``. В этом случае ``findface-facenapi`` будет использовать для идентификации только доступные шарды ``tntapi`` и укажет в ответе отношение количества доступных шардов ``tntapi`` к их общему количеству.

source: Check the services status. The command will return the services description, status (should be Active), path and running time.
ru: Проверьте статус сервисов. Команда вернет описание сервисов, их статус (должен быть Активен), путь и длительность текущей сессии.
