Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/installer.po
Languages: ru

source: Standalone Installer
ru: Развертывание на одном сервере из инсталлятора

source: To install FindFace Enterprise Server SDK in a standalone configuration, you can use the :program:`<findface-server-xxx>.run` file. Do the following:
ru: Для развертывания FindFace Enterprise Server SDK на одном сервере можно использовать файл :program:`<findface-server-xxx>.run`. Последовательность действий:

source: The .run file cannot be used for FindFace Enterprise Server SDK update from version 2.3 or earlier.
ru: Файл .run не предназначен для обновления FindFace Enterprise Server SDK с версии 2.3 или более ранних версий.

source: Put the .run file into some directory on the designated host (for example, `/home/username`).
ru: Поместите файл ``.run`` в любую папку на сервере установки (например, ``/home/username``).

source: From this directory, make the .run file executable.
ru: Из данной папки сделайте файл ``.run`` в исполняемым.

source: Execute the .run file.
ru: Запустите файл ``.run``.

source: The ``ntech`` user will be automatically created at this stage. To avoid a conflict, make sure that such a user does not already exist in the system.
ru: На данном этапе будет автоматически создан пользователь ``ntech``. Во избежание конфликта убедитесь, что пользователь с таким именем отсутствует в системе.

source: The installer will perform several automated checks to ensure that the host meets the system requirements. After that, FindFace Enterprise Server SDK components will be automatically installed, configured and/or started in the following configuration:
ru: Инсталлятор проверит, соответствует ли сервер системным требованиям. После этого компоненты FindFace Enterprise Server SDK будут автоматически установлены, настроены и запущены в соответствии со следующей конфигурацией:

source: Component
ru: Компонент

source: Details
ru: Особенности установки

source: Installed and started with enabled and configured dynamic person creation and “friend or foe” identification.
ru: Устанавливается и запускается с включенной и настроенной группировкой лиц одного человека в базе данных и распознаванием «свой-чужой».

source: Installed and started with the number of instances ``N = min(cores, RAM/2Gb)/2`` and enabled and configured gender, age and emotions recognition.
ru: Устанавливается и запускается с количеством экземпляров: ``N = min(cores, RAM/2Gb)/2`` с включенным и настроенным распознаванием пола, возраста и эмоций.

source: Installed and started with the number of tntapi shards: ``N = min(cores, RAM/2Gb)/2``
ru: Устанавливается и запускается с количеством шардов tntapi: ``N = min(cores, RAM/2Gb)/2``

source: Installed. Before use, consult the :ref:`component documentation <fast-index>`.
ru: Устанавливается. Перед использованием ознакомьтесь c :ref:`документацией по компоненту <fast-index>`.

source: Installed and started.
ru: Устанавливается и запускается.

source: Only installed. Use the command line interface or FindFace Web UI to manually start it. Before use, consult the :ref:`component documentation <video>`.
ru: Устанавливается. Для ручного запуска используйте интерфейс командной строки или веб-интерфейс FindFace Web UI. Перед использованием ознакомьтесь с :ref:`документацией по компоненту <video>`.

source: Only installed. Exclusively for experienced users. Before use, be sure to consult the :ref:`component documentation <extraction-api>`.
ru: Устанавливается. Только для опытных пользователей. Перед использованием обязательно ознакомьтесь с :ref:`документацией по компоненту <extraction-api>`.

source: FindFace Web UI
ru: Веб-интерфейс FindFace

source: Only installed. Use the command line interface to work with it. Before use, consult the :ref:`component documentation <bulk-face>`.
ru: Устанавливается. Для работы с компонентом используйте интерфейс командной строки. Перед использованием ознакомьтесь с :ref:`документацией по компоненту <bulk-face>`.

source: Tarantool Database
ru: База данных Tarantool

source: Installed. Used to pretty-print API responses from FindFace Server.
ru: Устанавливается. Используется для структурирования API-ответов от FindFace Enterprise Server SDK в формате JSON.

source: Once the installation is complete, the following output will be shown in the console:
ru: По завершении установки в консоль будет выведена информация, необходимая для использования FindFace Enterprise Server SDK.

source: Be sure to save this data: you will need it later.
ru: Обязательно сохраните эти данные: они вам понадобятся.

source: Upload a license file via the NTLS web interface ``http://<Host_IP_address>:3185/#/``. To access the NTLS web interface, use the credentials provided in the console.
ru: Загрузите файл лицензии через веб-интерфейс NTLS ``http://<IP_адрес_сервера>:3185/#/``. Для доступа в веб-интерфейс NTLS используйте логин и пароль, выведенные в консоли.

source: Depending on whether the host belongs to a network, the host IP address in the links to FindFace web services is provided either as ``127.0.0.1``, or ``IP address in the network``.
ru: IP-адрес сервера установки в ссылках на веб-интерфейсы FindFace имеет вид ``127.0.0.1`` или ``<IP_адрес_в_сети>``, в зависимости от того, принадлежит ли сервер к сети.
