Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/load_balancing.po
Languages: ru

source: Load Balancing with NginX
ru: Балансировка нагрузки с помощью NginX

source: To enhance throughput and reduce latency in highload installations with severe requirements to resource optimization, we recommend you to set up `nginx load balancing <https://www.nginx.com/resources/admin-guide/load-balancer/>`__.
ru: Для увеличения производительности и уменьшения времени обработки запросов в высоконагруженных системах с повышенными требованиями к оптимизации ресурсов рекомендуется настроить `балансировку нагрузки с помощью nginx <https://www.nginx.com/resources/admin-guide/load-balancer/>`__.

source: With load balancing, traffic, instead of being directed to a single instance of a component, is proxied via nginx and distributed across multiple instances of the component in a round-robin fashion. As a result, you remarkably reduce latency and improve overall performance, scalability and reliability of your system.
ru: Если нагрузка балансируется, входящий поток запросов вместо того, чтобы направиться на обработку в единственный экземпляр компонента, проходит через прокси-сервер и распределяется между несколькими экземплярами этого компонента в режиме round-robin (циклически). Результатом является значительное уменьшение времени ожидания обработки запроса, а также улучшение общей производительности, масштабируемости и надежности системы.

source: Load balancing can be set up for the following components:
ru: Нагрузка может быть сбалансирована для следующих компонентов:

source: Component
ru: Компонент

source: Recommended number of instances per host
ru: Рекомендуемое количество экземпляров на одном физическом сервере

source: 1 is usually enough. When it comes to findface-facenapi, load balancing is usually set up only in a cluster environment with several findface-facenapi hosts, 1 findface-facenapi instance running on each host. In this case, traffic is distributed across these hosts.
ru: Одного экземпляра на сервер обычно бывает достаточно. Применительно к компоненту ``findface-facenapi`` нагрузка обычно балансируется только в кластерной среде между несколькими физическими серверами ``findface-facenapi``.

source: Number of CPU cores minus 1. Gives a significant performance gain.
ru: Количество ядер процессора минус 1. Дает значительный выигрыш в производительности.

source: 1, automatically load-balanced. Set up load balancing only across extraction-api instances located on different physical hosts.
ru: 1 с автоматической балансировкой нагрузки. Балансировка нагрузки применяется только к экземплярам ``extraction-api``, установленным на различных физических серверах.

source: Do the following:
ru: Выполните следующие действия:

source: Copy the content of the ``/lib/systemd/system/findface-nnapi.service`` file into a new file ``/etc/systemd/system/findface-nnapi@.service``.
ru: Скопируйте содержимое файла ``/lib/systemd/system/findface-nnapi.service`` в новый файл ``/etc/systemd/system/findface-nnapi@.service``.

source: Create a new nginx configuration file.
ru: Создайте новый файл конфигурации nginx.

source: Insert the following `text <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/nnapi>`__ into the configuration file. In the text, substitute provided ports for findface-nnapi instances ('upstream nnapibackends') and the findface-nnapi listening port ('listen') with their actual values. Port numbers should be unique for each component on the host.
ru: Вставьте следующий `текст <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/nnapi>`__ в файл конфигурации. В тексте замените номера портов, предложенные для экземпляров ``findface-nnapi`` (``upstream nnapibackends``), и номер слушающего порта (``listen``) на актуальные значения. Номера портов должны быть уникальны для каждого компонента на сервере.

source: Enable the load balancer in nginx.
ru: Включите балансировщик нагрузки в nginx.

source: Restart nginx.
ru: Перезапустите nginx.

source: For each findface-nnapi instance, enable autostart.
ru: Добавьте каждый экземпляр ``findface-nnapi`` в автозагрузку.

source: Start the findface-nnapi instances.
ru: Запустите экземпляры ``findface-nnapi``.

source: From now on, requests sent to findface-nnapi will be distributed over 2 findface-nnapi instances in the round-robin mode. You can view the process of requests distribution in the findface-nnapi log file /var/log/syslog (look for different process_id values).
ru: Теперь запросы, отправленные в ``findface-nnapi``, будут распределяться между двумя экземплярами ``findface-nnapi`` в режиме round-robin. Распределение запросов наглядно отображается в логе ``findface-nnapi`` ``/var/log/syslog`` (обратите внимание на различные значения id процессов).

source: You can use this method to set up load balancing across instances on several physical hosts.
ru: Вы можете использовать данный метод для балансировки нагрузки между экземплярами компонента на различных физических серверах.
