Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/prerequisites.po
Languages: ru

source: Prerequisite Software
ru: Необходимое стороннее программное обеспечение

source: In order to run successfully, FindFace Server needs the following software:
ru: FindFace Enterprise Server SDK использует в работе следующее программное обеспечение сторонних производителей:

source: Prerequisite software
ru: Стороннее ПО

source: Usage
ru: Использование

source: Installation
ru: Установка

source: Internal database that provides proper functioning of FindFace Server. Stores faces metadata, galleries details, settings and other internal data.
ru: Внутренняя база данных, обеспечивающая функционирование Сервера FindFace. В ней хранятся метаданные лиц, информация о галереях, настройки и другие данные внутреннего характера.

source: Manually, before installing the FindFace Server components
ru: Вручную перед установкой компонентов Сервера

source: Stores faces vector data.
ru: База данных, в которой хранятся биометрические данные лиц (векторы признаков).

source: Automatically along with the tntapi component.
ru: Автоматически, вместе с компонентом ``tntapi``.

source: Prior to installing FindFace Server, set up a database for it. You may install MongoDB either on the application host where the findface-facenapi component resides, or on a dedicated host. For the standalone architecture, we recommend you the first option. FindFace Enterprise Server SDK is compatible with `MongoDB 3.2 <https://docs.mongodb.com/v3.2/tutorial/install-mongodb-on-ubuntu/>`_ or later.
ru: Перед установкой компонентов Сервера необходимо установить базу данных MongoDB, которая будет служить внутренней базой данных Сервера. Вы можете установить базу данных MongoDB на одном сервере с компонентом ``findface-facenapi`` или на удаленном сервере. Если FindFace Enterprise Server SDK развертывается на одном физическом сервере, база данных MongoDB устанавливается там же. FindFace Enterprise Server SDK совместим с `MongoDB 3.2 <https://docs.mongodb.com/v3.2/tutorial/install-mongodb-on-ubuntu/>`_ и более поздними версиями.

source: Install MongoDB on Application Host
ru: Установка базы данных MongoDB на сервере с findface-facenapi

source: To install the latest stable version of MongoDB (3.4 at the moment) on the application host, do the following:
ru: Для установки последней стабильной версии MongoDB (на данный момент 3.4) на одном сервере с компонентом ``findface-facenapi`` выполните следующие действия:

source: To install a different version of MongoDB, please refer to that version’s documentation. For example, see version `3.2 <https://docs.mongodb.com/v3.2/tutorial/install-mongodb-on-ubuntu/>`_.
ru: Для установки другой версии MongoDB ознакомьтесь с документацией по этой версии, например, с `3.2 <https://docs.mongodb.com/v3.2/tutorial/install-mongodb-on-ubuntu/>`_.

source: Import the public key used by the package management system::
ru: Импортируйте ключ подписи, используемый системой управления пакетами::

source: Create a list file (/etc/apt/sources.list.d/mongodb-org-3.4.list ) for MongoDB::
ru: Создайте список пакетов для MongoDB ``/etc/apt/sources.list.d/mongodb-org-3.4.list``::

source: Reload the local package database::
ru: Перезагрузите локальную базу данных пакетов::

source: Install the latest stable version of MongoDB::
ru: Установите последнюю стабильную версию MongoDB::

source: Start the ``mongod`` service::
ru: Запустите сервис ``mongod``::

source: Install MongoDB on Dedicated Host
ru: Установка базы данных MongoDB на удаленном сервере

source: To install MongoDB on a dedicated host, do the following:
ru: Для установки MongoDB на удаленном сервере выполните следующие действия:

source: On the dedicated host, install MongoDB in the same manner as on the :ref:`application host <mongodb-app>`.
ru: На удаленном сервере установите последнюю стабильную версию MongoDB по аналогии с :ref:`установкой на сервере с findface-facenapi <mongodb-app>`.

source: Open the MongoDB configuration file::
ru: Откройте для редактирования файл конфигурации базы данных MongoDB::

source: To allow for incoming connections, comment out the line bind_ip = 127.0.0.1. This will allow MongoDB to accept connections from any IP address. Ensure that the only access to the host is from the LAN::
ru: Для того чтобы разрешить входящие подключения к базе данных со всех IP-адресов, закомментируйте строку ``bind_ip = 127.0.0.1``. Убедитесь, что доступ к серверу с установленной базой данных возможен только из локальной сети.

source: Restart the ``mongod`` service::
ru: Перезапустите сервис ``mongod``::

source: Connect to Existing MongoDB
ru: Подключение к существующей базе данных MongoDB

source: If you wish to establish connection to an existing MongoDB instance, specify its IP address in the :ref:`network settings <configure-network>`.
ru: При подключении к существующей базе данных MongoDB необходимо указать IP-адрес соответствующего сервера в :ref:`настройках конфигурации <configure-network>`.
