Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/rest_about.po
Languages: ru

source: How to Use REST API
ru: Как пользоваться REST API

source: Endpoint
ru: Точка доступа

source: API Version
ru: Версия API

source: Authentication
ru: Авторизация

source: All API methods require a simple token-based HTTP Authentication. In order to authenticate, you should put the word "Token" and your token key into the Authorization HTTP header, separated by a whitespace:
ru: Для всех методов API должна быть выполнена простая HTTP-авторизация на базе токена. Для того чтобы авторизовать запрос, после заголовка ``Authorization`` нужно добавить метку ``Token`` и ввести через пробел свой токен авторизации:

source: To learn how to create a token, consult :ref:`token`.
ru: См. :ref:`token`.

source: All requests that fail to provide a valid authentication token will result in a ``HTTP 401 Unauthorized`` response.
ru: Если запрос не содержит действительный токен, результатом его выполнения будет являться ответ ``HTTP 401 Unauthorized``.

source: Common Object Types
ru: Распространенные типы объектов

source: Face
ru: Лицо

source: Represents a human face. Note that it might be several faces on a single photo. Different photos of the same person as also considered to be different faces.
ru: Представляет собой изображение человеческого лица. Имейте в виду, что на одной фотографии может быть несколько лиц. Разные изображения одного и того же человека также рассматриваются как разные лица.

source: ``"timestamp" (string)``: time of face object creation as ISO8601 string.
ru: ``"timestamp"`` (строка): время создания объекта лицо в формате ISO8601.

source: ``"photo" (string)``: URL of file name of a photo that had been used to create the face object.
ru: ``"photo"`` (строка): URL или имя файла с изображением, которое было использовано для создания объекта лицо.

source: ``"photo_hash" (string)``: Hash of the original photo. Note that identical photos will always have the same hash, and different photos will most certainly have different hashes. Don't interpret this value and don't make assumptions about particular hash function used for hash calculation.
ru: ``"photo_hash"`` (строка): хэш исходной фотографии. Имейте в виду, что хэш идентичных фотографий будет одинаков, в то время как разные фотографии с большой вероятностью будут иметь разный хэш. Данный параметр не подлежит интерпретированию.

source: ``"thumbnail" (string)``: URL of face thumbnail stored on FindFace servers.
ru: ``"thumbnail"`` (строка): URL миниатюры лица, хранящейся на Сервере.

source: ``"x1" (number)``: x coordinate of the top-left corner of face's bounding box on the original photo.
ru: ``"x1" (число)``: координата x левого верхнего угла прямоугольника с лицом (рамки) на исходной фотографии.

source: ``"y1" (number)``: y coordinate of the top-left corner of face's bounding box on the original photo.
ru: ``"y1" (число)``: координата y левого верхнего угла прямоугольника с лицом (рамки) на исходной фотографии.

source: ``"x2" (number)``: x coordinate of the bottom-right corner of face's bounding box on the original photo.
ru: ``"x2"`` (число): координата x нижнего правого угла прямоугольника с лицом (рамки) на исходной фотографии.

source: ``"y2" (number)``: y coordinate of the bottom-right corner of face's bounding box on the original photo.
ru: ``"y2"`` (число): координата y нижнего правого угла прямоугольника с лицом (рамки) на исходной фотографии.

source: ``"meta" (string)``: metadata string that you can use to store any information associated with the face.
ru: ``"meta"`` (строка): строка с метаданными, которая может быть использована для хранения любой связанной с лицом информации (например, имени человека).

source: ``"galleries" (string[])``: array of galleries names that have this face.
ru: ``"galleries" (string[])``: массив имен галерей, в которых хранится лицо.

source: Bounding Box (bbox)
ru: Рамка

source: Represents a rectangle on a photo. Usually used as a face's bounding box. May be specified in two ways:
ru: Представляет собой прямоугольник на фотографии, как правило, содержащий лицо. Может быть задан одним из следующих способов:

source: Separated coordinates:
ru: Список координат со значениями:

source: ``"x1" (number)``: x coordinate of the top-left corner of the bounding box.
ru: "x1" (число): координата x левого верхнего угла прямоугольника с лицом;

source: ``"y1" (number)``: y coordinate of the top-left corner of the bounding box.
ru: "y1" (число): координата y левого верхнего угла прямоугольника с лицом;

source: ``"x2" (number)``: x coordinate of the bottom-right corner of the bounding box.
ru: "x2" (число): координата x нижнего правого угла прямоугольника с лицом;

source: ``"y2" (number)``: y coordinate of the bottom-right corner of the bounding box.
ru: "y2" (число): координата y нижнего правого угла прямоугольника с лицом.

source: Array of coordinates ``[x1, y1, x2, y2]``
ru: Линейно: [x1, y1, x2, y2].

source: The API methods accept both formats, but always return bbox as a JSON dictionary.
ru: В API-запросах можно использовать оба формата, однако независимо от того, какой формат был использован, запрос вернет координаты рамки в представлении JSON.

source: Note that in some case the coordinates might be outside photo dimensions, including negative values.
ru: Имейте в виду, что рамка может выходить за физические границы фотографии, включая отрицательные значения координат.

source: Parameters Format
ru: Формат Параметров

source: There are three ways to pass parameters to the API methods:
ru: Существуют следующие способы передачи параметров в методы API:

source: ``application/json``: parameters are represented by a JSON contained in the body.
ru: ``application/json``: в формате JSON в теле запроса.

source: ``application/x-www-form-urlencoded``: parameters are represented by form field names and values.
ru: ``application/x-www-form-urlencoded``: с использованием имен полей формы и значений этих полей.

source: ``multipart/form-data``: parameters are encoded into separate parts. This way supports uploading a photo image file in the same request.
ru: ``multipart/form-data``: параметры кодируются несколькими частями. Данный способ поддерживает загрузку фотографии в том же запросе.

source: ``query string``: parameters are appended to request URI. When passing parameters in a query string, complex structures (such as bboxes) should be encoded in JSON.
ru: ``query string``: параметры добавляются в конец URI запроса. При передаче параметров этим способом сложные структуры, такие как координаты рамок, должны быть представлены в формате JSON.

source: There are two ways of specifying a photo image file:
ru: Существует два способа задать файл с изображением:

source: As a publicly accessible URL.
ru: как публичный адрес в сети Интернет (прямой, без переадресации),

source: Included in a request as part of multipart form.
ru: включить в запрос в составе multipart/form-data.

source: All responses are in JSON format and UTF-8 encoding.
ru: Все ответы отправляются в формате JSON и кодировке UTF-8.

source: How to Use Examples
ru: Использование примеров из документации

source: Confidence Thresholds
ru: Пороговая схожесть лиц при верификации и идентификации

source: For some methods you need to specify a threshold for verification or identification confidence. The higher is the threshold, the less are chances that a wrong person will be positively verified or identified, however, some valid photos may also fail verification.
ru: Для некоторых методов необходимо задать пороговую степень схожести лиц. При верификации данное значение используется для принятия решения о совпадении или несовпадении лиц. Чем выше порог, тем меньше шансов на положительную верификацию нелегитимного человека, однако некоторые подходящие фотографии могут также не пройти верификацию. При идентификации в результаты поиска попадают только те лица, чья степень схожести с искомым лицом превышает пороговую.

source: There are 4 pre-defined threshold levels:
ru: Существует 4 предустановленных порога:

source: Pagination
ru: Разбиение по страницам

source: Some methods (such as ``GET /faces/`` and ``GET /meta/``) may potentially return thouthands and hundreds of thouthands results. To avoid problems associated with such large amounts, we have introduced pagination.
ru: Некоторые методы (такие как ``GET /faces/`` и ``GET /meta/``) могут возвращать тысячи, если не сотни тысяч результатов. Для того чтобы избежать связанных с этим проблем, Сервер возвращает результаты с разбиением по страницам.

source: Methods that support pagination return two more parameters in addition to a list of results:
ru: Методы, поддерживающие разбиение по страницам, возвращают в дополнение к результатам еще 2 параметра:

source: ``prev_page``: URL to the previous page (path and query only)
ru: ``prev_page``: адрес предыдущей страницы (содержит только путь метода и указатель предыдущей порции результатов).

source: ``next_page``: URL to the next page (path and query portion only)
ru: ``next_page``: адрес следующей страницы (содержит только путь метода и указатель следующей порции результатов).

source: For example, if ``GET http://<facenapi_ip>:8000/v0/faces/`` has returned the ``next_page`` value '``/v0/faces/?max_id=12345'``, you should request ``GET http://<facenapi_ip:8000/v0/faces/?max_id=12345`` to get the next portion of the results.
ru: Таким образом, если метод ``GET http://<facenapi_ip>:8000/v0/faces/`` вернул параметр ``next_page`` со значением ``/v0/faces/?max_id=12345``, для получения следующей порции результатов необходим запрос ``GET http://<facenapi_ip:8000/v0/faces/?max_id=12345``.

source: Limits
ru: Ограничения

source: Limit
ru: Параметр

source: Value
ru: Значение

source: Image formats
ru: Формат изображения

source: Maximum photo file size
ru: Максимальный размер файла

source: 10 MB
ru: 10 MБ

source: Minimal size of a face
ru: Минимальный размер лица

source: 50x50 pixels
ru: 50x50 пикселей

source: Maximum number of detected faces on a single photo
ru: Максимальное количество лиц на изображении

source: Unlimited
ru: Неограничено

source: Additionally, the URL provided to the API to fetch an image should be public (without authentication) and direct (without any redirects).
ru: В дополнение к этому, URL изображения должен быть публичным (не требующим авторизации) и прямым (без перенаправлений).

source: Error Reporting
ru: Сообщения об ошибках

source: If a method fails, it always returns a response with a HTTP code other than 200 and a JSON body containing the error description. The error body always includes at least two fields: code and status:
ru: Если метод выполнить не удается, Сервер возвращает ответ с кодом HTTP, отличном от 200, а также тело ответа в формате JSON, содержащее описание ошибки. Тело ответа всегда содержит хотя бы 2 поля — ``code`` и ``status``:

source: ``code`` is a short string in CAPS_AND_UNDERSCORES, usable for automatic decoding.
ru: ``code`` — это код ошибки, который может быть использован для автоматического преобразования;

source: ``reason`` is a human-readable description of the error and should not be interpreted automatically.
ru: ``reason`` — это описание ошибки, предназначенное для прочтения человеком, а не для автоматического преобразования.

source: Common Error Codes
ru: Распространенные коды ошибок представлены в таблице ниже:

source: Error code
ru: Код ошибки

source: Description
ru: Описание

source: A wrong authentication token or no token has been provided.
ru: Неверный токен авторизации или токен не был предоставлен.

source: Some parameters are invalid. This response type has additional attributes 'param' and 'value' describing which parameter caused the error.
ru: Некоторые параметры метода недействительны. Данный тип ответа содержит дополнительные атрибуты ``параметр`` и ``значение`` для описания ошибочных параметров.

source: The request body doesn't contain a valid JSON.
ru: Тело запроса содержит неверно сформированный JSON.

source: Your request cannot be processed because some components are experiencing an outage.
ru: Запрос не может быть обработан из-за недоступности некоторых компонентов Сервера.
