Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/test_requests.po
Languages: ru

source: Test Requests
ru: Тестовые запросы

source: Before you can proceed with development and deliver face recognition services to your customers, make sure that the FindFace Server components are working. To do so, run the test requests below, minding the sequence. To pretty-print responses, we recommend you to use :program:`jq`.
ru: Перед тем как приступить к программированию и использованию распознавания лиц в своем приложении, убедитесь, что компоненты Сервера FindFace работают надлежащим образом. Для этого выполните по порядку приведенные ниже тестовые запросы. Для того чтобы структурировать текст ответов на запросы, используйте обработчик JSON :program:`jq`.

source: The request messages here are provided only for reference. To create valid requests out of the examples below, replace the token in the messages with the :ref:`actual <token>` one.
ru: Сообщения запросов приведены в качестве примера. Вам потребуется заменить токен авторизации в запросах на :ref:`актуальный <token>`.

source: To proceed with development, find more code samples (in C#, PHP, Java and Python) on our `GitHub <https://github.com/NTech-Lab/ffserver-examples>`_.
ru: Вы можете найти примеры кода на C#, PHP, Java и Python на нашем ресурсе `GitHub <https://github.com/NTech-Lab/ffserver-examples>`_.

source: How to Pretty-Print Responses
ru: Структурирование ответов на запросы

source: List Galleries
ru: Получение списка галерей

source: This request returns the name of the only gallery existing at the present moment. It is the ``default`` gallery. Relevant REST API method: :ref:`/galleries GET <galleries-get>`.
ru: Данный запрос возвращает имя единственной на данный момент галереи (создана по умолчанию). Соответствующий метод REST API: :ref:`/galleries GET <galleries-get>`.

source: Request
ru: Запрос

source: Response
ru: Ответ

source: Create New Gallery
ru: Создание галереи

source: This request creates a new gallery ``testgal``. Relevant REST API method: :ref:`/galleries/new POST <gallery-post>`.
ru: Данный запрос создает новую галерею ``testgal``. Соответствующий метод REST API: :ref:`/galleries/new POST <gallery-post>`.

source: Detect Face in Image
ru: Обнаружение лица на фотографии

source: This request detects faces in a sample image on the Internet and returns coordinates of the rectangle around a detected face (:ref:`bbox <bbox>`). Relevant REST API method: :ref:`/detect POST <detect-post>`.
ru: Данный запрос обнаруживает лицо на тестовом изображении, размещенном в сети Интернет, и возвращает координаты рамки вокруг лица (:ref:`bbox <bbox>`). Соответствующий метод REST API: :ref:`/detect POST <detect-post>`.

source: Add Face to Gallery
ru: Добавление лица в галерею

source: Compare Face with Those from Gallery
ru: Поиск лица в галерее

source: Request #1
ru: Запрос №1

source: Request #2
ru: Запрос №2

source: Compare Two Faces
ru: Сравнение двух лиц

source: List Faces from Galleries
ru: Получение списка лиц в галереях

source: Recognize Gender, Age and Emotions
ru: Распознавание пола, возраста и эмоций
