Repository: sasha-carlos/doctest2
Catalog: docs/locales/*/LC_MESSAGES/video_methods.po
Languages: ru

source: Methods for Video Face Detection
ru: Методы для работы с видеокамерами

source: These methods extend :ref:`general API methods <methods>` of FindFace Enterprise Server SDK.
ru: Методы, приведенные в данном разделе, являются расширением :ref:`общих методов API <methods>` FindFace Enterprise Server SDK и предназначены для работы с видеокамерами.

source: Method /camera POST
ru: Метод /camera POST

source: Description
ru: Описание

source: Creates a new camera.
ru: Данный метод создает новую видеокамеру на Сервере.

source: Parameters:
ru: Параметры:

source: ``meta`` [optional]: some user-defined string identifier
ru: ``meta`` [опционально]: пользовательская строка с метаданными видеокамеры

source: ``url`` [optional]: url address of the camera's stream
ru: ``url`` [опционально]: URL потока видеокамеры

source: ``detector`` [optional]: some user-defined string identifier
ru: ``detector`` [опционально]: виртуальный детектор, соответствующий списку видеокамер.

source: ``rot`` [W,H,X,Y] [optional]: enable detecting and tracking faces only inside a clipping rectangle (ROT, region of tracking).
ru: ``rot`` [W,H,X,Y] [опционально]: включает обнаружение и отслеживание лиц только внутри заданного прямоугольника (ROT, region of tracking).

source: ``roi`` [W,H,X,Y] [optional]: enable posting faces detected only inside a region of interest (ROI).
ru: ``roi`` [W,H,X,Y] [опционально]: включает отправку на Сервер FindFace лиц, обнаруженных только внутри интересующей области (ROI, region of interest).

source: Returns:
ru: Возвращает:

source: A JSON representation of the added camera or a failure reason.
ru: Представление данных добавленной камеры в JSON или причину ошибки.

source: Example
ru: Пример

source: Request
ru: Запрос

source: Response
ru: Ответ

source: Method /camera GET
ru: Метод /camera GET

source: Lists all cameras.
ru: Данный метод возвращает список всех камер на Сервере.

source: This method doesn't accept any additional parameters.
ru: Отсутствуют.

source: The list of all cameras.
ru: Список всех камер.

source: Method /camera/<camera\_id> GET
ru: Метод /camera/<camera\_id> GET

source: Gets information about the camera with ``id = camera_id``.
ru: Данный метод возвращает данные заданной видеокамеры с ``id = camera_id``.

source: Info about the camera or a failure reason.
ru: Информацию о камере или причину ошибки.

source: Method /camera/<camera_id> PUT
ru: Метод /camera/<camera_id> PUT

source: This method can be used to modify certain fields of the camera object with ``id = camera_id``.
ru: Данный метод используется для изменения метаданных заданной камеры с ``id = camera_id``.

source: ``meta`` [optional]: new meta string
ru: ``meta`` [опционально]: новая строка с метаданными

source: ``rot`` [W,H,X,Y] [optional]: enable detecting and tracking faces only inside a clipping rectangle (ROT, region of tracking). If you use ROT, be sure to pass this parameter to the camera each time you send a PUT request because if this parameter is missing or empty in the request, ROT on the camera will be deleted.
ru: ``rot`` [W,H,X,Y] [опционально]: включает обнаружение и отслеживание лиц только внутри заданного прямоугольника (ROT, region of tracking). Если вы используете ROT, обязательно передавайте этот параметр на камеру каждый раз, когда вы отправляете запрос PUT, поскольку если данный параметр в запросе PUT отсутствует или его значение не задано, ROT на камере будет удален.

source: ``roi`` [W,H,X,Y] [optional]: enable posting faces detected only inside a region of interest (ROI). If you use ROI, be sure to pass this parameter to the camera each time you send a PUT request because if this parameter is missing or empty in the request, ROI on the camera will be deleted.
ru: ``roi`` [W,H,X,Y] [опционально]: включает отправку на Сервер FindFace лиц, обнаруженных только внутри интересующей области (ROI, region of interest). Если вы используете ROI, обязательно передавайте этот параметр на камеру каждый раз, когда вы отправляете запрос PUT, поскольку если данный параметр в запросе PUT отсутствует или его значение не задано, ROI на камере будет удален.

source: A JSON representation of the updated camera with id = <camera\_id>.
ru: Представление данных камеры в JSON.

source: Example #1
ru: Пример №1

source: Example #2
ru: Пример №2

source: Method /camera/<camera_id> DELETE
ru: Метод /camera/<camera_id> DELETE

source: Deletes the camera with ``id = camera_id``.
ru: Данный метод удаляет заданную камеру с ``id = camera_id``.

source: HTTP 204 No Content in the case of success, or the reason of failure.
ru: HTTP 204 No Content в случае успеха или причину ошибки.
